
import random
dares = [
    "Позвони другу и скажи: «Мне нужно тебе кое в чём признаться...» — и выдержи паузу 5 секунд.",
    "Покажи последнее фото в галерее.",
    "Расскажи о своём любимом фильме или сериале в течение 30 секунд.",
    "Изобрази человека из вашей компании, а остальные пусть угадают.",
    "Отправь другу одно совершенно случайное слово без объяснений.",
    "Танцуй 30 секунд под первую попавшуюся песню.",
    "Придумай рэп про человека.",
    "Скажи каждому игроку по одному неожиданному комплименту.",
    "30 секунд изображай ведущего новостей и рассказывай о происходящем в комнате.",
    "Позволь игрокам придумать тебе новое имя на ближайшие 3 круга.",
    "Расскажи историю, используя только 5 слов.",
    "Назови свой топ-3 любимых блюда.",
    "Расскажи о месте, куда ты хотел(а) бы поехать.",
    "Спой припев любой песни.",
    "Поменяйся местом с игроком, которого выберет группа.",
    "Придумай смешное прозвище каждому игроку.",
    "2 круга отвечай на всё с абсолютно серьёзным лицом.",
    "Расскажи о своём сегодняшнем дне в трёх предложениях.",
    "Позволь другому игроку выбрать тебе аватарку из уже имеющихся фото на 10 минут.",
    "Придумай безумный сюжет фильма, где все присутствующие — персонажи.",
]

truth = [
    "Какой самый неловкий момент с тобой случался?",
    "Какое первое впечатление ты обычно производишь, а какое на самом деле?",
    "Какой твой любимый способ проводить свободное время?",
    "Какой самый смешной случай ты помнишь из детства?",
    "За какой поступок тебе до сих пор немного стыдно?",
    "Какую ложь ты чаще всего говоришь, чтобы избежать разговора?",
    "Какой секрет о твоём характере люди обычно узнают не сразу?",
    "Какой поступок другого человека тебя моментально раздражает?",
    "Какой человек оказал на тебя большое влияние?",
    "Какой комплимент тебе запомнился больше всего?",
    "Что ты делаешь, когда тебе кто-то сильно нравится?",
    "Какой навык ты хотел(а) бы освоить?",
    "Какой самый неожиданный подарок ты когда-либо получал(а)?",
    "Что обычно поднимает тебе настроение?",
    "С кем из присутствующих ты бы поменялся жизнью на один день?",
    "Какой поступок ты никогда не смог(ла) бы простить другу?",
    "О чём чаще всего ты думаешь перед сном?",
    "Какой самый запоминающийся день в твоей жизни?",
    "Какое мнение о тебе люди часто ошибочно имеют?",
    "Если бы можно было узнать одну правду о любом человеке здесь, кого бы ты спросил(а) и о чём?",
]

print()
print()

while True:
    choice=input(print("Выбери правда или действие")).strip().lower()
    if choice == 'стоп':
        print("")
        break
    elif choice == 'правда':
        print(random.choice(truth))
    elif choice == 'действие':
        print(random.choice(dares))
    else:
        print("Ошибка! попробуйте еще раз")
    print()    
